app/views/projects/index.html.erb

SELECT `project_categories`.* FROM `project_categories`
SELECT `projects`.* FROM `projects`
---

<% @projects.group_by{|g| g.project_category }.each do |category, project| %>