app/controllers/angular_controller.rb

SELECT `translators`.* FROM `translators` WHERE `translators`.`account` = 'maydaycha' LIMIT 1
INSERT INTO `translators` (`account`, `category`, `created_at`, `name`, `password`, `updated_at`) VALUES ('maydaycha', 1, '2014-03-28 17:28:26', '邱耀慶', 'a047226657', '2014-03-28 17:28:26')
---
  def create
    # set_headers
    @t = Translator.find_by_account(params[:account])
    if @t
      render :json => { :status => "fail", :reason => "duplicate" }
    else
      begin
        @translator = Translator.create(
          :account => params[:account],
          :password => Digest::MD5.hexdigest(params[:password]),
          :name => params[:name],
          :category => params[:category]
          )

SELECT `project_categories`.* FROM `project_categories`
---
  def getJobCategory
    # set_headers
    @category = ProjectCategory.all(:select => "id, name")

SELECT `translators`.* FROM `translators` WHERE `translators`.`account` = 'maydaycha' LIMIT 1
---
  def login
    @t = Translator.find_by_account(params[:account])