app/controllers/oauth_controller.rb

  def get_access_token
    if @oauth_verifier = params[:oauth_verifier]
      @request_token = session[:request_token]
      @access_token = @request_token.get_access_token(:oauth_verifier => @oauth_verifier)
      @content = @access_token.get('http://api.freelancer.com/Profile/getAccountDetails.json')
      # puts @content.body
      puts @access_token.inspect
      puts ""
      puts @access_token.token
      puts ""
      render :json => @content.body
      # redirect_to 'http://www.google.com'
      user = Oauth.create( :name => 'maydaycha', :token => @access_token.token, :secret => @access_token.secret)
---
INSERT INTO `oauths` (`created_at`, `name`, `secret`, `token`, `updated_at`) VALUES ('2014-03-18 14:13:56', 'maydaycha', '9704d075ef99789f860f3a5b26c18e5fea1f3633', 'e38ffb7a4b7ef62bb52ff3410eba25f317ad76e4', '2014-03-18 14:13:56')