app/controllers/projects_controller.rb

SELECT `projects`.* FROM `projects` ORDER BY `projects`.`id` ASC
SELECT `projects`.* FROM `projects`
---
  def set_word_count
    @projects = Project.order(:id)
    @projects.each do |p|