app/controllers/projects_controller.rb

SELECT `projects`.* FROM `projects`
SELECT `project_categories`.* FROM `project_categories`
---
  def index
    @projects = Project.all
    @category = ProjectCategory.all

SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 1 LIMIT 1
UPDATE `projects` SET `name_chinese` = 'qwe', `require_skills_chinese` = '請問', `description_chinese` = '而且瓦斯的', `updated_at` = '2014-03-24 15:57:17' WHERE `projects`.`id` = 1
---
  def update
    @project = Project.find(params[:id])
    @project.update(params.permit![:project])

SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 1 LIMIT 1
DELETE FROM `projects` WHERE `projects`.`id` = 1
---
  def destroy
    @project = Project.find(params[:id])
    @project.destroy

SELECT `translators`.* FROM `translators` WHERE `translators`.`account` = 'maydaycha' LIMIT 1
SELECT `projects`.* FROM `projects` WHERE `projects`.`translators` = 1 LIMIT 1
---
  def get_project_by_translator
    puts session[:account]
    if session[:account]
      @translator = Translator.find_by_account(session[:account])
      if @translator
        @projects = Project.where(:translators => @translator['id'])

SELECT `projects`.* FROM `projects` WHERE `projects`.`id` = 11 LIMIT 1
UPDATE `projects` SET `name_chinese` = '測試okok', `description_chinese` = '和哈哈哈和', `is_translation` = 1, `updated_at` = '2014-03-29 16:39:57' WHERE `projects`.`id` = 12
---
  def update_project_from_angular
    if params[:projectName] && params[:projectDescription] && params[:projectId]
      @p = Project.find(params[:projectId])
      @p.name_chinese = params[:projectName]
      @p.description_chinese = params[:projectDescription]
      @p.is_translation = 1
      @p.save

INSERT INTO `projects` (`budget`, `created_at`, `description`, `duration`, `from_source`, `name`, `outside_id`, `project_category`, `remain_time`, `require_skills`, `updated_at`, `url`) VALUES ('10,30', '2014-03-28 03:59:26', 'This mini project is for sample translation of a single page (300-400 words) from an academic website of a University from English to Russian and Ukrainian in order to fine suitable translators.\r\n\r\nThe chosen translators will be tasked to translate the 1500 pages the website contains.\r\n\r\nProject for Russian and Ukrainian native speakers only.', '2014-04-03 22:26:08', 'freelancer', 'English to Russian Translation of academic website sample', 5729211, 10, '2014-04-03 22:26:08', 'English (UK), Russian, Translation', '2014-03-28 03:59:26', 'http://www.freelancer.com/projects/Translation-English-UK/English-Russian-Translation-academic.5729211.html')
---
  def storeProjectsDetails
    @content = @access_token.get("http://api.freelancer.com/Project/searchProjects.json?searchjobtypecsv=#{params[:jobtype]}")
    hash = JSON.parse @content.body
    skip = 0
    hash['json-result']['items'].each do |ele, index|
      @content = @access_token.get("http://api.freelancer.com/Project/getProjectDetails.json?projectid=#{ele['projectid']}")
      hash2 = JSON.parse @content.body
      h = hash2['json-result']
      begin
        project = Project.create( :outside_id => h['id'], :name => h['name'], :url => h['url'], :budget => "#{h['budget']['min']},#{h['budget']['max']}", :require_skills => "#{h['jobs'].join(", ")}", :from_source => 'freelancer', :description => h['short_descr'], :project_category => h['jobsDetails'][0]['category_id'], :currency => h['currency'], :start_date => h['start_date'], :end_date => h['end_date'], :currency_code => h['currencyDetails']['code'], :currency_exchangerate => h['currencyDetails']['exchangerate'] )

SELECT `projects`.* FROM `projects` ORDER BY `projects`.`id` ASC
---
  def wirte_job_to_csv
    @projects = Project.order(:id)

SELECT `projects`.* FROM `projects` ORDER BY `projects`.`id` ASC
---
  def excel_download
    @projects = Project.order(:id)