app/controllers/translators_controller.rb

  def index
    @translators = Translator.all()
---
SELECT `translators`.* FROM `translators`

  def show
    @translator = Translator.find(params[:id])
---
SELECT `translators`.* FROM `translators` WHERE `translators`.`id` = 2 LIMIT 1

  def create
    if Translator.find_by_account(params[:account])
      render :json => { :status => "fail", :reason => "duplicate" }
    else
      begin
        @translator = Translator.create(
          :account => params[:account],
          :password => Digest::MD5.hexdigest(params[:password]),
          :name => params[:name],
          :category => params[:category]
        )
---
SELECT `translators`.* FROM `translators` WHERE `translators`.`account` = 'sun02' LIMIT 1
INSERT INTO `translators` (`account`, `category`, `created_at`, `name`, `password`, `updated_at`) VALUES ('sun02', 4, '2014-03-29 17:32:27', 'david', '81dc9bdb52d04dc20036dbd8313ed055', '2014-03-29 17:32:27')

  def destroy
    @translator = Translator.find(params[:id])
    @translator.destroy
---
SELECT `translators`.* FROM `translators` WHERE `translators`.`id` = 2 LIMIT 1
DELETE FROM `translators` WHERE `translators`.`id` = 2

  def getJobCategory
    # set_headers
    @category = ProjectCategory.all(:select => "id, name")
---
SELECT id, name FROM `project_categories`

  def login
    @t = Translator.find_by_account(params[:account])
---
SELECT `translators`.* FROM `translators` WHERE `translators`.`account` = 'maydaycha' LIMIT 1